Revit 2027 API
StairsTextOrientation Enumeration
 The options to be used when orienting text annotations relative to stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsTextOrientation
Public Enumeration StairsTextOrientation
public enum class StairsTextOrientation
type StairsTextOrientation
Members
Member name | Value | Description
Horizontal | 0 |  Indicator text will be displayed horizontally.
Vertical | 1 |  Indicator text will be displayed vertically.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace